docs/lisp-running-from-terminal.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-10-21 Wed 11:44 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Running Lisp from the terminal</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Philip Dumaresq" />
<link rel="stylesheet" type="text/css" href="https://comp-348.github.io/assets/org.css" />
</head>
<body>
<div id="content">
<h1 class="title">Running Lisp from the terminal</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf1e6376">Question:</a>
<ul>
<li><a href="#orgd9d9f10">SBCL:</a>
<ul>
<li><a href="#orgd7abf3e"><code>--script</code></a></li>
<li><a href="#org01f4f70"><code>--load</code></a></li>
</ul>
</li>
<li><a href="#org79cbef8">CCL</a></li>
<li><a href="#orga5bac9a">CLisp</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div class="org-center">
<p>
<a href="index.html">Back</a>
</p>
</div>

<div id="outline-container-orgf1e6376" class="outline-2">
<h2 id="orgf1e6376">Question:</h2>
<div class="outline-text-2" id="text-orgf1e6376">
<p>
How do I run lisp code from my terminal in vscode? 
</p>

<p>
There are a few different ways that you can do it, and it depends on what compiler you're
using. Refer to the section for your compiler. 
</p>
</div>

<div id="outline-container-orgd9d9f10" class="outline-3">
<h3 id="orgd9d9f10">SBCL:</h3>
<div class="outline-text-3" id="text-orgd9d9f10">
<p>
With SBCL there are two options you'll care about, <code>--script</code> and <code>--load</code>. 
</p>


<p>
<a id="org96115c7"></a>
</p>
</div>
<div id="outline-container-orgd7abf3e" class="outline-4">
<h4 id="orgd7abf3e"><code>--script</code></h4>
<div class="outline-text-4" id="text-orgd7abf3e">
<p>
The first of the two will be most like running a Python script or something like that. You pass it 
a file, it'll evaluate the file, write to your terminal, and then exit. 
</p>

<p>
So if we have the following file:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #5B6268;">;; </span><span style="color: #5B6268;">filename.lisp</span>
(print <span style="color: #98be65;">"hello world"</span><span style="color: #5B6268;">)</span>
</pre>
</div>

<p>
And then we run this in the terminal:
</p>

<div class="org-src-container">
<pre class="src src-bash">$ sbcl --script filename.lisp
<span style="color: #98be65;">"hello world"</span>
$
</pre>
</div>

<p>
You can see that it'll execute the file, print things, and then exit.
</p>

<p>
<a id="org855ee99"></a>
</p>
</div>
</div>
<div id="outline-container-org01f4f70" class="outline-4">
<h4 id="org01f4f70"><code>--load</code></h4>
<div class="outline-text-4" id="text-org01f4f70">
<p>
If you use <code>--load</code>, then it will evaluate everything in your file, and then drop you into an
interactive prompt so that you can interact with your program:
</p>

<p>
So let's say we have the following file:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #5B6268;">;; </span><span style="color: #5B6268;">filename.lisp</span>
(<span style="color: #51afef;">defun</span> <span style="color: #c678dd;">sum</span> (list<span style="color: #5B6268;">)</span>
  (<span style="color: #51afef;">if</span> list (+ (car list) (sum (cdr list))) 0<span style="color: #5B6268;">))</span>
</pre>
</div>

<p>
And we call <code>--load</code> in the terminal:
</p>

<div class="org-src-container">
<pre class="src src-bash">$ sbcl --load filename.lisp
<span style="color: #5B6268;">#</span><span style="color: #5B6268;">&lt;some preamble about sbcl you can ignore&gt;</span>
* (sum <span style="color: #98be65;">'(1 2 3 4 5))</span>
<span style="color: #98be65;">15</span>
</pre>
</div>

<p>
Then as you can see, we're able to interact with our program, call functions defined in our file and
stuff like that right from our terminal.
</p>

<p>
When we're interacting with Lisp like this, we can also reload our file without ever exiting from
Lisp, so we can do:
</p>

<div class="org-src-container">
<pre class="src src-bash">$ sbcl --load filename.lisp
<span style="color: #5B6268;">#</span><span style="color: #5B6268;">&lt;some preamble about sbcl you can ignore&gt;</span>
* (sum (list 1 2 3 4 5))
15
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">Make some changes to our filename.lisp file</span>
* (load <span style="color: #98be65;">"filename.lisp"</span>)

T
* (new-function-that-wasnt-there-before)
NIL
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org79cbef8" class="outline-3">
<h3 id="org79cbef8">CCL</h3>
<div class="outline-text-3" id="text-org79cbef8">
<p>
CCL mostly has one argument for using it at the terminal that you'll care about, which is the <code>--load</code>
argument. When you give CCL the <code>--load</code> argument, it will drop you into an interactive prompt the
same way that it will do when using <code>--load</code> with SBCL. Refer to the section about <a href="#org855ee99"><code>--load</code></a> for SBCL.
</p>
</div>
</div>

<div id="outline-container-orga5bac9a" class="outline-3">
<h3 id="orga5bac9a">CLisp</h3>
<div class="outline-text-3" id="text-orga5bac9a">
<p>
CLisp can be used almost the same as SBCL, with a couple differences. You have two main options with
CLisp for how to execute your Lisp files. You can either execute the entire Lisp file and terminate
the program after the file is done, or you can load the program into an interactive prompt and
interact with your program.
</p>

<p>
To run a file and terminal, simply do:
</p>
<div class="org-src-container">
<pre class="src src-bash">$ clisp filename.txt
</pre>
</div>

<p>
To know more about how this works, refer to the <a href="#org96115c7"><code>--script</code></a> option for SBCL. Just keep in mind that
anywhere that the <code>--script</code> option is provided in SBCL, you want to ignore that flag.
</p>

<p>
To load a file and interact with it, you use the <code>-repl</code> option. To learn about how to use this
option, you can refer to the <a href="#org855ee99"><code>--load</code></a> instructions for SBCL. Just keep in mind to replace any
instance of <code>--load</code> with <code>-repl</code>.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Philip Dumaresq</p>
<p class="date">Created: 2020-10-21 Wed 11:44</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
